### Thinking of our dataframe as a list

Now we can select the rows as we would select elements of a list.

In [20]:
movies_df.iloc[0]

year                       2013
imdb                  tt1711425
title             21 &amp; Over
test                     notalk
clean_test               notalk
binary                     FAIL
budget                 13000000
domgross            2.56824e+07
intgross            4.21958e+07
code                   2013FAIL
budget_2013$           13000000
domgross_2013$      2.56824e+07
intgross_2013$      4.21958e+07
period code                   1
decade code                   1
Name: 0, dtype: object

So above we just selected the first row by using `iloc` and then the row index of 0.

Let's select more than one row.

In [12]:
movies_df.iloc[:2]

,year,imdb,title,test,clean_test,binary,budget,domgross,intgross,code,budget_2013$,domgross_2013$,intgross_2013$,period code,decade code
0,2013,tt1711425,21 &amp; Over,notalk,notalk,FAIL,13000000,25682380.0,42195766.0,2013FAIL,13000000,25682380.0,42195766.0,1.0,1.0
1,2012,tt1343727,Dredd 3D,ok-disagree,ok,PASS,45000000,13414714.0,40868994.0,2012PASS,45658735,13611086.0,41467257.0,1.0,1.0

Now beyond selecting rows, we can also use `iloc` to also select certain columns.

In [14]:
movies_df.iloc[:2, :3]

   year       imdb          title
0  2013  tt1711425  21 &amp; Over
1  2012  tt1343727       Dredd 3D

So columns is the second argument to our `iloc` function.  And it works just like selecting from a list of elements in Python.

So with iloc we think of our dataframe as a list of row lists, and we selected our elements based on their order.  To select the first row and first column, we simply use the indices:

In [17]:
movies_df.iloc[0, 0]

2013

### Selecting with loc

Now we can also think of our dataframe as a set of key value pairs, like a dictionary.  And that is what the `loc` method is for.  Once again, here are the first couple of rows of our dataframe.

In [18]:
movies_df[:2]

,year,imdb,title,test,clean_test,binary,budget,domgross,intgross,code,budget_2013$,domgross_2013$,intgross_2013$,period code,decade code
0,2013,tt1711425,21 &amp; Over,notalk,notalk,FAIL,13000000,25682380.0,42195766.0,2013FAIL,13000000,25682380.0,42195766.0,1.0,1.0
1,2012,tt1343727,Dredd 3D,ok-disagree,ok,PASS,45000000,13414714.0,40868994.0,2012PASS,45658735,13611086.0,41467257.0,1.0,1.0

When we use `loc`, the

In [16]:
movies_df.loc[0]

year                       2013
imdb                  tt1711425
title             21 &amp; Over
test                     notalk
clean_test               notalk
binary                     FAIL
budget                 13000000
domgross            2.56824e+07
intgross            4.21958e+07
code                   2013FAIL
budget_2013$           13000000
domgross_2013$      2.56824e+07
intgross_2013$      4.21958e+07
period code                   1
decade code                   1
Name: 0, dtype: object